// ***********************************************************
// Этот пример support/e2e.ts обрабатывается и
// загружается автоматически перед вашими тестовыми файлами.
//
// Это место для размещения глобальной конфигурации и
// поведения, которое изменяет Cypress.
//
// Можно изменить местоположение этого файла или отключить
// автоматическое обслуживание файлов поддержки с помощью
// параметра конфигурации 'supportFile'.
//
// Вы можете прочитать больше здесь:
// https://on.cypress.io/configuration
// ***********************************************************

// Импорт commands.js с использованием синтаксиса ES2015:
import './commands'

// Импорт утилит для работы с БД
import './db'

// Вместо этого можно использовать CommonJS синтаксис:
// require('./commands')

